Revit 2027 API
CompoundStructure.HasStructuralDeck Property
 Checks if the compound structure has a structural deck.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasStructuralDeck { get; }
Public ReadOnly Property HasStructuralDeck As Boolean
	Get
public:
property bool HasStructuralDeck {
	bool get ();
}
member HasStructuralDeck : bool with get
Property Value
Boolean
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace